export const common = {
  welcome: 'Welcome to the tutorial KZ',
  backToMain: 'Сайтқа оралу',
  backToShop: 'Дүкенге оралу',
  goBack: 'Кері қайту',
  choiceLoan: 'Несие шарттарын таңдаңыз',
  installment: 'Бөліп төлеу',
  loan: 'Несие',
  month: 'ай',
  monthlyPayment: 'Ай сайынғы төлем',
  saveSelection: 'Таңдауды сақтау',
  term: 'Мерзім',
  purchaseAmount: 'Сатып алу сомасы',
  enterIin: 'ЖСН енгізіңіз',
  continue: 'Жалғастыру',
  ourPartners: 'Біздің серіктестер',
  loanProcessing: 'Несие ресімдеу',
  sentSmsCode: 'нөміріне SMS код жіберілді',
  smsCode: 'SMS-код',
  enterSms: 'SMS - кодты енгізіңіз',
  sendSms: 'SMS - кодты жіберу',
  agreementText:
    // eslint-disable-next-line max-len
    'Маған тіркелген ұялы телефон нөмірі арқылы SMS хабарламада алған бір реттік кодты енгізу арқылы мен Airba FinTech қызметтерін пайдалану туралы келісімге қосылатынымды және жеке деректерді жинауға және өңдеуге келісімге қол қоятынымды растаймын.',
  notOfferFromPartners: 'Қазіргі уақытта сізге арналған ұсыныстар жоқ',
  tryTolittlePrice:
    'Картамен төлеңіз немесе несие және бөліп төлеу ұсыныстарын басқа уақытта алуға тырысыңыз',
  alterOffers: 'Басқа да ұсыныстар',
  withYourRequest: 'Сіздің сұранысыңыз бойынша',
  orderProcessing: 'Тапсырысты қабылдау',
  toNumber: 'Нөмірге',
  SmsNotCorrect: 'SMS коды қате енгізілді',
  redirectClient: 'Клиент банктің бетіне қайта бағытталды',
  orderCancelled: 'Өтініш жойылды',
  orderProcessed: 'Өтінім өңделді',
  yourOrderCancelled:
    'Өкінішке орай, сіздің өтінішіңізді серіктес банк қабылдамады',
  useAnotherMethod:
    'Тапсырысты басқа жолмен төлеңіз немесе біраз уақыттан кейін несие және бөліп төлеу ұсыныстарын алуға тырысыңыз',
  orderSuccess: 'Құттықтаймыз, өтінішіңіз сәтті жіберілді.',
  managerCalls: 'Дүкен менеджері сізбен мүмкіндігінше тезірек хабарласады',
  installmentProcess: 'Бөліп төлеу',
  redirectTo: 'Сіз сол бетке қайта бағытталасыз',
  goTo: 'Бару',
  sendSmsCode: 'SMS кодын қайта жіберуге болады',
  sentSms: 'SMS кодын жіберіңіз',
  agree: 'Публичной оферте',
  sec: 'сек.',
  terms: 'Шарттар',
  maturity: 'Өтеу мерзімі',
  orderInfo: 'Тапсырыс туралы ақпарат',
  store: 'Дүкен',
  amount: 'Сомасы',
  bankOffers: 'Банктер мен серіктестердің ұсыныстары',
  showsHere: 'Біз олардың жауабын алған кезде осында шығарамыз.',
  wait: 'Тағы біраз күтіңіз, біз сізге ұсыныстарды таңдап жатырмыз',
  just: 'Сәл қалды...',
  enterOtpCode: 'Мына нөмірге жіберілген SMS-тен кодты енгізіңіз:',
  resend: 'Қайта жіберу',
  resendAfter: 'Қайта жіберу',
  afterSec: 'кейін',
  offersTitle: 'Серіктестердің ұсыныстары',
  offersForYou: 'Сіз үшін тамаша ұсыныстар',
  displayFilter: 'Көрсету',
  typeCredit: 'Несие түрі',
  byBank: 'Банктер арқылы',
  byTerm: 'Мерзімі бойынша',
  allOffers: 'Барлық ұсыныстар',
  all: 'Барлық',
  loadOffers: 'Ұсыныстар жүктелуде',
  weSelectOffers: 'Біз ұсыныстарды серіктестерімізден таңдап жатырмыз',
  notForYou: 'Қазіргі уақытта сізге ешқандай ұсыныстар жоқ',
  payWithCard:
    'Картамен төлеңіз немесе несие және бөліп төлеу ұсыныстарын басқа уақытта алуға тырысыңыз',
  noOffers: 'Ұсыныстар жоқ',
  offers: 'ұсыныстар',
  noOffersText:
    'Өкінішке орай, бұл серіктестің сізге ұсыныстары жоқ. Басқасын таңдаңыз',
  paymentMethod: {
    title: 'Төлем әдістері',
    byCard: {
      title: 'Онлайн карта арқылы',
      content:
        'Несие бойынша ай сайынғы төлемді Қазақстан Республикасындағы кез келген банктің картасымен төлеңіз',
      payBtn: {
        label: 'жалғастыру',
      },
    },
    byKassa24: {
      title: 'Kassa24 терминалында',
      content:
        '1. Kassa24 терминалына өтіңіз\n' +
        '2. AIRBA Pay қызметін іздеңіз\n' +
        '3. Іздеу нәтижелерінде AIRBA Pay басыңыз\n' +
        '4. Несие алуға өтініш берген ЖСН-ді енгізіңіз\n' +
        '5. Несие туралы ақпаратты тексеріңіз\n' +
        '6. Ай сайынғы төлемді төлеу үшін қажетті соманы енгізіп, «Төлеу» басыңыз.\n' +
        '\n' +
        '!Kassa24 терминалы өзгеріс бермейді.',
    },
    byYurta: {
      title: '«Юрта» терминалында',
      content:
        '1. Yurta компаниясының кез келген Ю-Станция терминалына барыңы\n' +
        '2. Ю-Финансы бөлімін таңдаңыз2.\n' +
        '3. МКҰ және МҚҰ микрокредиттері кіші бөлімін таңдаңыз\n' +
        '4. Тізімнен AIRBA Pay таңдаңыз\n' +
        '5. Несие алуға өтініш берген ЖСН-ді енгізіңіз\n' +
        '6. Несие туралы ақпаратты тексеріңі\n' +
        '7. Ай сайынғы төлемді төлеу үшін қажетті соманы енгізіп, «Төлеу» басыңыз.\n' +
        '\n' +
        '!Ю-Станция терминалы өзгеріс бермейді.',
    },
  },
  paymentForm: {
    title: 'Несие төлеу',
    iin: {
      label: 'Сіздің ЖСН',
      placeholder: 'ЖСН енгізіңіз',
      error: 'Сіз қате ЖСН енгіздіңіз',
    },
    smsCode: {
      label: 'Телефон нөміріңізге жіберілген SMS кодты енгізіңіз',
      placeholder: 'SMS-код',
    },
    sendBtn: {
      label: 'Жіберу',
    },
  },
  loanInfo: {
    title: 'Несие төлеу',
    iin: 'ЖСН',
    monthlyPayment: {
      label: '{{date}} дейінгі ай сайынғы төлем:',
    },
    kzt: {
      label: 'теңге',
    },
    payBtn: {
      label: 'Төлеу',
      hint: '«Төлеу» түймесін басу арқылы сіз төлем бетіне қайта бағытталасыз',
    },
    tryBtn: {
      label: 'Қайталап көріңіз',
    },
  },
  paymentResult: {
    title: 'Несие төлеу',
    successMessage: 'Құттықтаймыз! Төлем төленді.',
    errorMessage: 'Бірдеңе дұрыс болмады :(',
    tryBtn: {
      label: 'Қайталап көріңіз',
    },
  },
  errors: {
    clientNotFound: 'Клиент табылмады',
    smsCodeWrong: 'Жарамсыз SMS коды',
    smsCodeSend: 'SMS кодын жіберу қатесі',
    smsCodeCheck: 'SMS кодын тексеру кезінде қате',
    getLoanInfo: 'Несие туралы ақпаратты алу қатесі',
    getPaymentLink: 'Төлем сілтемесін алу қатесі',
    somethingWrong: 'Әттеген-ай! Бірдеме дұрыс болмады',
    accessDenied: 'Рұқсат берілмеді',
    tryAgain: 'Қайталап көріңіз',
    notExistsPage:
      'Кешіріңіз, сіз іздеген бет жоқ немесе жылжытылды, мұнда кейбір пайдалы сілтемелер берілген...',
  },
}
