export const common = {
  welcome: 'Welcome to the tutorial RU',
  backToMain: 'Назад на сайт',
  backToShop: 'Вернуться к магазину',
  goBack: 'Вернуться назад',
  choiceLoan: 'Выберите условия для кредита',
  installment: 'Рассрочка',
  loan: 'Кредит',
  month: 'мес',
  monthes: 'месяцев',
  monthlyPayment: 'Ежемесячный платеж',
  saveSelection: 'Сохранить выбор',
  term: 'Срок',
  purchaseAmount: 'Сумма покупки',
  enterIin: 'Введите ИИН',
  continue: 'Продолжить',
  ourPartners: 'Наши партнеры',
  loanProcessing: 'Оформление кредита',
  sentSmsCode: ' было отправлено SMS с кодом',
  smsCode: 'SMS-код',
  enterSms: 'Введите SMS - код ',
  sendSms: 'Отправить SMS - код',
  sureGoToStore: 'Вы уверены, что хотите вернуться к магазину?',
  afterWillRemove: 'После возврата все данные будут утеряны',
  yes: 'Да',
  no: 'Нет',
  agreementText:
    // eslint-disable-next-line max-len
    'Вводя одноразовый код, полученный мной в SMS-сообщении по зарегистрированному на меня абонентскому номеру мобильной связи, подтверждаю, что присоединяюсь к Соглашению об использовании Сервисов Airba FinTech и подписываю Согласие на сбор и обработку персональных данных',
  notOfferFromPartners: 'Для вас пока нет предложений',
  tryTolittlePrice:
    'Оплатите заказ картой или попробуйте получить предложения по кредиту и рассрочке в другой раз',
  alterOffers: 'Альтернативные предложения',
  withYourRequest: 'По вашему запросу',
  orderProcessing: 'Оформление заказа',
  toNumber: 'На номер',
  SmsNotCorrect: 'SMS код введен неверно',
  redirectClient: ' Клиент был перенаправлен на страницу банка',
  orderCancelled: 'Заявка была отменена',
  orderProcessed: 'Заявка обработана',
  yourOrderCancelled: 'К сожалению ваша заявка была отклонена банком-партнером',
  useAnotherMethod:
    'Оплатите заказ другим способом или попробуйте получить предложения по кредиту и рассрочке через некоторое время',
  orderSuccess: 'Поздравляем, ваша заявка успешно оформлена',
  managerCalls: 'Менеджер магазина свяжется с вами в самое ближайшее время',
  installmentProcess: 'Оформление рассрочки',
  redirectTo: 'Вы будете перенаправлены на страницу',
  goTo: 'Перейти',
  sendSmsCode: 'Отправить SMS-код повторно через',
  sentSms: 'Отправить SMS-код',
  agree: 'Публичной оферте',
  sec: 'сек.',
  terms: 'Условия',
  maturity: 'Срок погашения',
  orderInfo: 'Информация о заказе',
  store: 'Магазин',
  amount: 'Сумма',
  bankOffers: 'Предложения от банков и партнёров',
  showsHere: 'Появятся здесь, когда мы получим их ответ',
  wait: 'Подождите ещё немного, подбираем предложения для вас',
  just: 'Осталось совсем чуть-чуть...',
  enterOtpCode: 'Введите код из СМС, которое отправили на номер',
  resendAfter: 'Отправить повторно через',
  resend: 'Отправить повторно',
  offersTitle: 'Предложения от партнеров',
  afterSec: '',
  offersForYou: 'Выгодные предложения для вас',
  displayFilter: 'Отобразить',
  byBank: 'По банкам',
  byTerm: 'По сроку',
  typeCredit: 'Тип кредитования',
  allOffers: 'Все предложения',
  all: 'Все',
  loadOffers: 'Загрузка предложений',
  noOffers: 'Предложений нет',
  offers: 'предложения',
  weSelectOffers: 'Подбираем предложения от наших партнеров',
  notForYou: 'Для вас сейчас нет предложений',
  payWithCard:
    'Оплатите заказ картой или попробуйте получить предложения по кредиту и рассрочке в другой раз',
  noOffersText:
    'К сожалению, у этого партнера нет для вас предложений. Выберите другого',
  paymentMethod: {
    title: 'Способы оплаты',
    byCard: {
      title: 'Картой онлайн',
      content:
        'Оплатите ежемесячную выплату по вашему кредиту картой любого банка РК',
      payBtn: {
        label: 'продолжить',
      },
    },
    byKassa24: {
      title: 'В терминале Касса24',
      content:
        '1. Подойдите к терминалу Касса24\n' +
        '2. Введите в поиске AIRBA Pay\n' +
        '3. В результатах поиска нажмите на AIRBA Pay\n' +
        '4. Введите ИИН на который вы оформляли кредит\n' +
        '5. Ознакомьтесь с информацией по кредиту\n' +
        '6. Внесите необходимую сумму для оплаты ежемесячного платежа и нажмите "Оплатить"\n' +
        '\n' +
        '!Терминал Касса24 не выдает сдачу.',
    },
    byYurta: {
      title: 'В терминале Yurta',
      content:
        '1. Подойдите к любому терминалу Ю-Станция компании Yurta\n' +
        '2. Выберите раздел Ю-Финансы\n' +
        '3. Выберите подраздел Микрокредиты МКО и МФО\n' +
        '4. Выберите в списке AIRBA Pay\n' +
        '5. Введите ИИН на который вы оформляли кредит\n' +
        '6. Ознакомьтесь с информацией по кредиту\n' +
        '7. Внесите необходимую сумму для оплаты ежемесячного платежа и нажмите "Оплатить"\n' +
        '\n' +
        '!Терминал Ю-Станция не выдает сдачу.',
    },
  },
  paymentForm: {
    title: 'Оплата кредита',
    iin: {
      label: 'ИИН',
      placeholder: 'Введите ваш ИИН',
      error: 'Вы ввели неверный ИИН',
    },
    smsCode: {
      label: 'Введите SMS-код отправленный на номер',
      placeholder: 'SMS-код',
    },
    sendBtn: {
      label: 'Отправить',
    },
  },
  loanInfo: {
    title: 'Оплата кредита',
    iin: 'ИИН',
    monthlyPayment: {
      label: 'Ежемесячный платеж до {{date}} составляет:',
    },
    kzt: {
      label: 'тенге',
    },
    payBtn: {
      label: 'Оплатить',
      hint: 'Нажав на кнопку “оплатить” вы будете перенаправлены на страницу оплаты',
    },
    tryBtn: {
      label: 'Попробовать еще раз',
    },
  },
  paymentResult: {
    title: 'Оплата кредита',
    successMessage: 'Поздравляем! Платеж погашен.',
    errorMessage: 'Что то пошло не так :(',
    tryBtn: {
      label: 'Попробовать еще раз',
    },
  },
  errors: {
    clientNotFound: 'Клиент не найден',
    smsCodeWrong: 'Неверный SMS-код',
    smsCodeSend: 'Ошибка при отправке SMS-кода',
    smsCodeCheck: 'Ошибка при проверке SMS-кода',
    getLoanInfo: 'Ошибка получения информации о займе',
    getPaymentLink: 'Ошибка получения ссылки на оплату',
    somethingWrong: 'Ой! Что-то пошло не так',
    accessDenied: 'Отказано в доступе',
    tryAgain: 'Пожалуйста, повторите попытку',
    notExistsPage:
      'Извините, страница, которую вы ищете, не существует или была перемещена, вот несколько полезных ссылок...',
  },
}
